{
    "preloader": {
        "settings": {
            "scenes": {
                "settingName": "scenesToPreload",
                "name": "Сцена",
                "label": "Сцена",
                "hint": "Список сцен которые будут предзагружены игроками при их входе в мир"
            },
            "audio": {
                "settingName": "audioToPreload",
                "name": "Аудио",
                "label": "Аудио",
                "hint": "Список аудиофайлов которые будут предзагружены игроками при их входе в мир"
            },
            "animations": {
                "settingName": "animationsToPreload",
                "name": "Анимации",
                "label": "Анимации",
                "hint": "Список анимаций которые будут предзагружены игроками при их входе в мир"
            }
        },
        "window": {
            "title": "Preloader",
            "placeholder": "Добавить (нажмите Enter)",
            "deletionTitle": {
                "scenes": "Удалить сцену из списка предзагружаемых?",
                "audio": "Удалить аудио из списка предзагружаемых?",
                "animations": "Удалить анимацию из списка предзагружаемых?"
            },
            "deletionDescription": {
                "scenes": "Вы уверены что хотите удалить эту сцену из списка предзагружаемых?",
                "audio": "Вы уверены что хотите удалить этот трек из списка предзагружаемых?",
                "animations": "Вы уверены что хотите удалить эту анимацию из списка предзагружаемых?"
            },
            "confirmation": {
                "cancel": "Отменить",
                "save": "Сохранить"
            },
            "importer": {
                "import-button": "Импорт в JSON",
                "export-button": "Экспорт из JSON"
            },
            "guideText": {
                "scenes": "Перетяните сцену в поле для ввода, либо напишите её id, после чего нажмите \"Enter\"",
                "audio": "Напишите полный путь к аудиофайлу (включая название файла и его расширение), после чего нажмите \"Enter\"",
                "audio-tooltip": "ВАЖНО! Предзагружены могут быть только небольшие файлы весом до нескольких мегабайт. Используйте предзагрузку аудио для предзагрузки коротких звуков требующих жесткого тайминга, таких как звук броска кубиков, или звук атак оружием",
                "animations": "Напишите полный путь к файлу (включая название файла и его расширение), либо, если это анимация Sequencer, вставьте его \"DatabasePath\" (можно получить в Sequencer Database Viewer), после чего нажмите \"Enter\""
            }
        },
        "warning": {
            "duplicate": {
                "scenes": "Эта сцена уже есть в списке",
                "audio": "Этот трек уже есть в списке",
                "animations": "Эта анимация уже есть в списке"
            },
            "wrongId": "Вы должны перенести СЦЕНУ в поле для ввода",
            "seqNotActive": "Модуль Sequencer не обнаружен",
            "wrongCategory": "Содержимое импортируемого JSON файла не соответствует категории"
        },
        "error": {
            "scenes": {
                "uiError": "Произошла ошибка при предзагрузке одной или нескольких сцен (подробности в консоли)",
                "consoleText1": "В списке сцен для предзагрузки существует один или несколько id несуществующих сцен. Остальные сцены были успешно предзагружены.",
                "consoleText2": "Вы можете посмотреть весь список в консоли с помощью команды \"PreloaderApp.getScenesToPreload()\"",
                "consoleText3": "Также, вы можете удалить id несуществующих сцен с помощью команды \"PreloaderApp.deleteScenesToPreload()\", введя строку или массив в качестве аргумента",
                "consoleText4-1": "- Сцена с id  <",
                "consoleText4-2": ">  не найдена"
            },
            "audio": {
                "uiError": "Произошла ошибка при предзагрузке одного или нескольких аудиофайлов (подробности в консоли)",
                "consoleText1": "В списке путей аудиофайлов для предзагрузки существует один или несколько путей несуществующих аудиофайлов. Остальные аудиофайлы были успешно предзагружены.",
                "consoleText2": "Вы можете посмотреть весь список в консоли с помощью команды \"PreloaderApp.getAudioToPreload()\"",
                "consoleText3": "Также, вы можете удалить пути несуществующих аудиофайлов с помощью команды \"PreloaderApp.deleteAudioToPreload()\", введя строку или массив в качестве аргумента",
                "consoleText4-1": "- Аудиофайл  <",
                "consoleText4-2": ">  не найден"
            },
            "sequencer": {
                "uiError": "Произошла ошибка при предзагрузке одной или нескольких анимации/файлов (подробности в консоли)",
                "consoleText1": "В массиве анимация для предзагрузке существует один или несколько названий/путей файлов, содержащий ошибку.",
                "consoleText2": "Вы можете посмотреть весь массив в консоли с помощью команды \"PreloaderApp.getAnimationsToPreload()\"",
                "consoleText3": "Также, вы можете удалить названия/пути несуществующих файлов с помощью команды \"PreloaderApp.deleteAnimationsToPreload()\", введя строку или массив в качестве аргумента"
            }
        }
    }
}